# Ultralytics 🚀 Custom YOLOv8n with Enhanced Head
# Author: Zhra Alipour (Ablation Study - Enhanced Fusion Head)

# Parameters
nc: 1  # number of classes (change if needed)
scales:
  n: [0.33, 0.25, 1024]  # same as YOLOv8n baseline

# ==================================================
# Backbone: standard YOLOv8n
# ==================================================
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, C2f, [128, True]]       # 2
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 6, C2f, [256, True]]       # 4
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 6, C2f, [512, True]]       # 6
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 3, C2f, [1024, True]]      # 8
  - [-1, 1, SPPF, [1024, 5]]        # 9 SPPF output = P5 feature map

# ==================================================
# Enhanced Neck + Head (Zhra Alipour Design)
# ==================================================
head:
  # ---- P5 → P4 Upsample & Fusion ----
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 10: upsample P5
  - [[10, 6], 1, Concat, [1]]                    # 11: fuse with P4
  - [-1, 1, C2f, [128, True]]                    # 12: refine P4

  # ---- P4 → P3 Upsample & Fusion ----
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 13
  - [[13, 4], 1, Concat, [1]]                    # 14: fuse with P3
  - [-1, 1, C2f, [64, True]]                     # 15: refined P3

  # ---- P3 → P4 Downsample & Fusion ----
  - [-1, 1, Conv, [64, 3, 2]]                    # 16
  - [[16, 12], 1, Concat, [1]]                   # 17
  - [-1, 1, C2f, [128, True]]                    # 18: refined P4

  # ---- P4 → P5 Downsample & Fusion ----
  - [-1, 1, Conv, [128, 3, 2]]                   # 19
  - [[19, 9], 1, Concat, [1]]                    # 20
  - [-1, 1, C2f, [256, True]]                    # 21: refined P5

  # ---- Optional Micro-Transformer (commented) ----
  # - [7, 1, MobileViTBlock, [128, 1, 4]]         # optional contextual enhancement

  # ---- Final Detection Head ----
  - [[15, 18, 21], 1, Detect, [nc]]              # Detect on P3, P4, P5
