# Ultralytics YOLOv8n with ECA and CoordAtt modules (lightweight, scaled for n)
# Author: Zhra & Grok
# License: AGPL-3.0
# Description: Scaled channels for n variant (gw=0.25)
nc: 80 # number of classes
scales:
  n: [0.33, 0.25, 1024]
# ========================
# Backbone
# ========================
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]] # 0-P1/2 (base 64*0.25=16)
  - [-1, 1, Conv, [32, 3, 2]] # 1-P2/4 (base 128*0.25=32)
  - [-1, 1, ECA, [8]] # ECA [32*0.25=8]
  - [-1, 3, C2f, [32, True]] # 2 (output 32)
  - [-1, 1, Conv, [64, 3, 2]] # 3-P3/8 (base 256*0.25=64)
  - [-1, 1, CoordAtt, [16]] # CoordAtt [64*0.25=16]
  - [-1, 6, C2f, [64, True]] # Scaled output
  - [-1, 1, Conv, [128, 3, 2]] # 5-P4/16 (512*0.25=128)
  - [-1, 6, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 7-P5/32 (1024*0.25=256)
  - [-1, 3, C2f, [256, True]]
  - [-1, 1, SPPF, [256, 5]] # 9 (scaled 1024*0.25=256)
# ========================
# Head (scale similarly)
# ========================
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # P5->P4
  - [[-1, 8], 1, Concat, [1]] # cat P4
  - [-1, 3, C2f, [128]] # 12 (scaled 512*0.25=128)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # P4->P3
  - [[-1, 5], 1, Concat, [1]] # cat P3
  - [-1, 3, C2f, [64]] # 15 (256*0.25=64)
  - [-1, 1, Conv, [64, 3, 2]] # down
  - [[-1, 12], 1, Concat, [1]] # cat
  - [-1, 3, C2f, [128]] # 18
  - [-1, 1, Conv, [128, 3, 2]] # down
  - [[-1, 9], 1, Concat, [1]] # cat P5
  - [-1, 3, C2f, [256]] # 21
  - [[15, 18, 21], 1, Detect, [nc]] # Detect
