task: detect
nc: 1

backbone:
  - [-1, 1, Conv,   [16, 3, 2]]    
  - [-1, 1, Conv,   [32, 3, 2]]    
  - [-1, 1, C2f,    [32, True]]    

  - [-1, 1, Conv,   [64, 3, 2]]    
  - [-1, 1, GAM,    [64]]           # GAM at P3
  - [-1, 1, C2f,    [64, True]]    

  - [-1, 1, Conv,   [128, 3, 2]]   
  - [-1, 1, C2f,    [128, True]]   

  - [-1, 1, Conv,   [256, 3, 2]]   
  - [-1, 1, SPPF,   [256, 5]]      

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]     
  - [-1, 3, C2f, [128]]            

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]     
  - [-1, 3, C2f, [64]]             

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]    
  - [-1, 3, C2f, [128]]            

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]     
  - [-1, 3, C2f, [256]]            

  - [[14, 17, 20], 1, Detect, [nc]]
