# ultra_nano_detect_fixed_fusion_noECA.yaml
# Custom YOLO variant without ECA (for ablation)

task: detect
nc: 1
scale: "s"

backbone:
  - [-1, 1, Conv,     [16, 3, 2]]      # 0: P1/2
  - [-1, 1, DWConv,   [32, 3, 2]]      # 1: P2/4
  - [-1, 1, C2f,      [32, True]]      # 2

  - [-1, 1, DWConv,   [64, 3, 2]]      # 3: P3/8
  - [-1, 1, CoordAtt, [64]]            # 4
  - [-1, 1, C2f,      [64, True]]      # 5

  - [-1, 1, DWConv,   [128, 3, 2]]     # 6: P4/16
  - [-1, 1, C2f,      [128, True]]     # 7

  - [-1, 1, DWConv,   [256, 3, 2]]     # 8: P5/32
  - [-1, 1, SPPF,     [256, 5]]        # 9

head:
  # P5 → P4 upsample & fusion
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 10
  - [[10, 7], 1, Concat, [1]]                    # 11
  - [-1, 1, C2f,         [128, True]]            # 12

  # P4 → P3 upsample & fusion
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 13
  - [[13, 5], 1, Concat, [1]]                    # 14
  - [-1, 1, C2f,         [64, True]]             # 15 (P3/8 small)

  # P3 → P4 downsample & fusion
  - [-1, 1, Conv,        [64, 3, 2]]             # 16
  - [[16, 12], 1, Concat,[1]]                    # 17
  - [-1, 1, C2f,         [128, True]]            # 18 (P4/16 medium)

  # P4 → P5 downsample & fusion
  - [-1, 1, Conv,        [128, 3, 2]]            # 19
  - [[19, 9], 1, Concat, [1]]                    # 20
  - [-1, 1, C2f,         [256, True]]            # 21 (P5/32 large)

  # Final detect
  - [[15, 18, 21], 1, Detect, [nc]]              # 22
