# yolov8n_ema.yaml
# YOLOv8n + EMA (Efficient Multi-scale Attention)
# Task: object detection
# Single-class version (nc=1)
task: detect
nc: 1

backbone:
  - [-1, 1, Conv,   [16, 3, 2]]     # 0-P1/2
  - [-1, 1, Conv,   [32, 3, 2]]     # 1-P2/4
  - [-1, 1, C2f,    [32, True]]     # 2

  - [-1, 1, Conv,   [64, 3, 2]]     # 3-P3/8
  - [-1, 1, EMA,    [64]]           # ? EMA inserted at P3
  - [-1, 1, C2f,    [64, True]]     # 5

  - [-1, 1, Conv,   [128, 3, 2]]    # 6-P4/16
  - [-1, 1, C2f,    [128, True]]    # 7

  - [-1, 1, Conv,   [256, 3, 2]]    # 8-P5/32
  - [-1, 1, SPPF,   [256, 5]]       # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]]       # cat backbone P4
  - [-1, 3, C2f, [128]]             # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]       # cat backbone P3
  - [-1, 3, C2f, [64]]              # 15 (P3/8-small)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]      # cat head P4
  - [-1, 3, C2f, [128]]             # 18 (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]       # cat head P5
  - [-1, 3, C2f, [256]]             # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)
