# Ultralytics 🚀 YOLOv8 with ECA + CoordAtt modules integrated
# License: AGPL-3.0 - https://ultralytics.com/license
# Task: Object Detection

# Parameters
nc: 1  # number of classes

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 1, ECA, [128]]                 # 🔹 ECA attention after Conv
  - [-1, 3, C2f, [128, True]]           # 3
  - [-1, 1, Conv, [256, 3, 2]]          # 4-P3/8
  - [-1, 1, CoordAtt, [256]]            # 🔹 CoordAtt attention after downsample
  - [-1, 6, C2f, [256, True]]           # 6
  - [-1, 1, Conv, [512, 3, 2]]          # 7-P4/16
  - [-1, 6, C2f, [512, True]]           # 8
  - [-1, 1, Conv, [1024, 3, 2]]         # 9-P5/32
  - [-1, 3, C2f, [1024, True]]          # 10
  - [-1, 1, SPPF, [1024, 5]]            # 11

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 8], 1, Concat, [1]]                   # cat backbone P4
  - [-1, 3, C2f, [512]]                         # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [[-1, 6], 1, Concat, [1]]                   # cat backbone P3
  - [-1, 3, C2f, [256]]                         # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                  # 18
  - [[-1, 14], 1, Concat, [1]]                  # cat head P4
  - [-1, 3, C2f, [512]]                         # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 21
  - [[-1, 11], 1, Concat, [1]]                  # cat head P5
  - [-1, 3, C2f, [1024]]                        # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]]             # 24 Detect(P3, P4, P5)
